import { ref, computed } from 'vue'
import { defineStore } from 'pinia'
import axios from 'axios'
import { useRouter } from 'vue-router'

export const useMapStore = defineStore('map', () => {
  const koreaData = {
    "서울특별시": {
      "종로구": ["청운동", "신교동", "평창동", "효자동"],
      "강남구": ["역삼동", "삼성동", "대치동", "논현동"],
      "서초구": ["방배동", "서초동", "잠원동", "양재동"]
    },
    "부산광역시": {
      "해운대구": ["우동", "좌동", "중동", "송정동"],
      "사하구": ["감천동", "구평동", "다대동", "하단동"],
      "동래구": ["명륜동", "온천동", "안락동", "사직동"]
    },
    "대구광역시": {
      "중구": ["동성로", "삼덕동", "대봉동"],
      "수성구": ["범어동", "만촌동", "수성동", "황금동"],
      "달서구": ["상인동", "용산동", "성당동"]
    },
    "인천광역시": {
      "남동구": ["구월동", "만수동", "논현동"],
      "연수구": ["송도동", "연수동", "동춘동"],
      "부평구": ["부평동", "산곡동", "십정동"]
    },
    "광주광역시": {
      "동구": ["충장로", "대인동", "계림동"],
      "서구": ["화정동", "농성동", "치평동"],
      "북구": ["운암동", "문흥동", "매곡동"]
    },
    "대전광역시": {
      "서구": ["둔산동", "갈마동", "탄방동"],
      "유성구": ["노은동", "신성동", "전민동"],
      "동구": ["대동", "용운동", "신흥동"]
    },
    "울산광역시": {
      "남구": ["삼산동", "신정동", "달동"],
      "중구": ["학성동", "성남동", "태화동"],
      "동구": ["전하동", "화정동", "방어동"]
    },
    "경기도": {
      "수원시": ["팔달구", "영통구", "장안구", "권선구"],
      "성남시": ["분당구", "수정구", "중원구"],
      "용인시": ["수지구", "기흥구", "처인구"]
    },
    "강원도": {
      "춘천시": ["조양동", "석사동", "효자동"],
      "원주시": ["무실동", "단구동", "명륜동"],
      "강릉시": ["교동", "포남동", "옥천동"]
    },
    "충청북도": {
      "청주시": ["상당구", "서원구", "흥덕구", "청원구"],
      "충주시": ["연수동", "칠금동", "봉방동"],
      "제천시": ["명동", "영천동", "고암동"]
    },
    "충청남도": {
      "천안시": ["동남구", "서북구"],
      "아산시": ["온양동", "배방읍", "탕정면"],
      "공주시": ["신관동", "중동", "월송동"]
    },
    "전라북도": {
      "전주시": ["완산구", "덕진구"],
      "군산시": ["나운동", "조촌동", "수송동"],
      "익산시": ["영등동", "신동", "모현동"]
    },
    "전라남도": {
      "목포시": ["용당동", "하당동", "상동"],
      "여수시": ["돌산읍", "여천동", "소라면"],
      "순천시": ["조례동", "연향동", "해룡면"]
    },
    "경상북도": {
      "포항시": ["남구", "북구"],
      "경주시": ["황성동", "동천동", "안강읍"],
      "구미시": ["원평동", "송정동", "인동동"]
    },
    "경상남도": {
      "창원시": ["의창구", "성산구", "마산합포구", "마산회원구", "진해구"],
      "김해시": ["내외동", "삼계동", "장유동"],
      "진주시": ["상봉동", "하대동", "평거동"]
    },
    "제주특별자치도": {
      "제주시": ["연동", "노형동", "이도동"],
      "서귀포시": ["중문동", "서귀동", "대정읍"]
    }
  };
  return { koreaData }
}, { persist: true })
